server/project_server/test/stress-test/artillery.yml
config:
  target: "https://localhost:9999"
  phases:
    - duration: 10 # 얼마동안 할 지 // 초 단위
      arrivalRate: 1000 # 가상 사용자의 수
      name: "Warm up Test" # 단계 이름
      # maxVusers: 50 # 최대 동시 사용자
      # rampTo: 50 # 사용자 수를 arrivalRate에서 n명까지 늘린다.
      # pause: 60 # 60초간 중지 후 실행

  tls: # ssl 설정
    rejectUnauthorized: false # 안쓰겠다
scenarios:
  - flow:
      - post:
          url: "/api/v1/auth/signup"
          json:
            email: "{{test@naver.com}}"